{
  "architectures": ["DeepseekV3ForCausalLM"],
  "model_type": "kimi_k2",
  "num_hidden_layers": 61,
  "hidden_size": 7168,
  "num_attention_heads": 64,
  "num_key_value_heads": 64,
  "intermediate_size": 18432,
  "vocab_size": 163840,
  "max_position_embeddings": 262144,
  "n_routed_experts": 384,
  "n_shared_experts": 1,
  "num_experts_per_tok": 8,
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "first_k_dense_replace": 1,
  "kv_lora_rank": 512,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "v_head_dim": 128,
  "routed_scaling_factor": 2.827,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "tie_word_embeddings": false
}
