{
  "architectures": ["Qwen3VLMoeForConditionalGeneration"],
  "model_type": "qwen3_vl_moe",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "decoder_sparse_step": 1,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "max_position_embeddings": 262144,
    "mlp_only_layers": [],
    "model_type": "qwen3_vl_moe_text",
    "moe_intermediate_size": 1536,
    "norm_topk_prob": true,
    "num_attention_heads": 64,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 94,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "rope_theta": 5000000,
    "use_cache": true,
    "vocab_size": 151936
  },
  "tie_word_embeddings": false,
  "vision_config": {
    "depth": 27,
    "hidden_size": 1152,
    "num_heads": 16,
    "intermediate_size": 4304,
    "patch_size": 14,
    "out_hidden_size": 4096,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2,
    "in_channels": 3
  }
}
