{
  "architectures": ["Glm4MoeForCausalLM"],
  "model_type": "glm4_moe",
  "num_hidden_layers": 92,
  "hidden_size": 5120,
  "num_attention_heads": 96,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "intermediate_size": 12288,
  "vocab_size": 151552,
  "max_position_embeddings": 202752,
  "n_routed_experts": 160,
  "n_shared_experts": 1,
  "num_experts_per_tok": 8,
  "moe_intermediate_size": 1536,
  "first_k_dense_replace": 3,
  "routed_scaling_factor": 2.5,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "tie_word_embeddings": false
}
