{
  "architectures": ["Glm4MoeLiteForCausalLM"],
  "model_type": "glm4_moe_lite",
  "num_hidden_layers": 47,
  "hidden_size": 2048,
  "num_attention_heads": 20,
  "num_key_value_heads": 20,
  "head_dim": 64,
  "intermediate_size": 10240,
  "vocab_size": 154880,
  "max_position_embeddings": 202752,
  "n_routed_experts": 64,
  "n_shared_experts": 1,
  "num_experts_per_tok": 4,
  "moe_intermediate_size": 1536,
  "first_k_dense_replace": 1,
  "kv_lora_rank": 512,
  "q_lora_rank": 768,
  "qk_nope_head_dim": 192,
  "qk_rope_head_dim": 64,
  "v_head_dim": 256,
  "routed_scaling_factor": 1.8,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "tie_word_embeddings": false
}
