{
  "architectures": ["GlmMoeDsaForCausalLM"],
  "model_type": "glm_moe_dsa",
  "num_hidden_layers": 78,
  "hidden_size": 6144,
  "num_attention_heads": 64,
  "num_key_value_heads": 64,
  "head_dim": 64,
  "intermediate_size": 12288,
  "vocab_size": 154880,
  "max_position_embeddings": 202752,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "num_experts_per_tok": 8,
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "first_k_dense_replace": 3,
  "kv_lora_rank": 512,
  "q_lora_rank": 2048,
  "qk_nope_head_dim": 192,
  "qk_rope_head_dim": 64,
  "v_head_dim": 256,
  "routed_scaling_factor": 2.5,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "tie_word_embeddings": false
}
